docs/architecture.md
```mermaid
classDiagram

class CowApi {
  + getTrades() Trades
  + getOrders()
  + getTxOrders()
  + getOrder()
  + getQuote()
  + sendSignedOrderCancellation()
  + sendOrder()
  + getOrderLink()
}

CowApi ..> Trades
CowApi ..> Orders
CowApi ..> Quote
CowApi ..> SignedOrder

class CowSubgraphApi {
  + getLastHoursVolume()
  + getLastDaysVolume()
  + runQuery()
}

class MetadataApi {
  + generateAppDataDoc()
  + calculateAppDataHash()
  + uploadMetadataDocToIpfs()
  + decodeAppData()
  + appDataHexToCid()
  + getAppDataSchema()
  + validateAppDataDoc()
}

CowApi --> EnvConfig
CowSubgraphApi --> EnvConfig
MetadataApi --> EnvConfig
```
